//------------------------------------------------------------------------------
/// @file
/// @author   ハル研究所プログラミングコンテスト実行委員会
///
/// @copyright  (C)HAL Laboratory, Inc.
/// @attention  このファイルの利用は、同梱のREADMEにある
///             利用条件に従ってください。
//------------------------------------------------------------------------------

#pragma once

//------------------------------------------------------------------------------
namespace hpc {

/// 地形
enum class Terrain
{
    Plain,
    Bush,
    Sand,
    Pond,
    
    TERM,
};

} // namespace
// EOF
