//------------------------------------------------------------------------------
/// @file
/// @author   ハル研究所プログラミングコンテスト実行委員会
///
/// @copyright  (C)HAL Laboratory, Inc.
/// @attention  このファイルの利用は、同梱のREADMEにある
///             利用条件に従ってください。
//------------------------------------------------------------------------------

#pragma once

//------------------------------------------------------------------------------
namespace hpc {

/// 2次元ベクトル
class Vector2
{
public:
    /// @name コンストラクタ
    //@{
    Vector2();
    Vector2(float aX, float aY);
    //@}

    /// @name メンバ変数
    //@{
    float x;
    float y;
    //@}
};

} // namespace
// EOF
